rectangle('Position',[0 0 3000 1500])
hold on;
R_P11=[];
R_P12=[];
R_P31=[0 , 0 ; 0 , 229 ; 0 , 458 ;
406 , 0 ; 406 , 229 ; 406 , 458 ;
812 , 0 ; 812 , 229 ; 812 , 458 ;
1218 , 0 ; 1218 , 229 ; 1218 , 458 ;
1624 , 0 ; 1624 , 229 ; 1624 , 458 ;
2030 , 0 ; 2030 , 229 ; 2030 , 458 ;
2436 , 0 ; 2436 , 229 ; 2436 , 458 ;];
R_P32=[0,687;0,1093;229 , 687 ; 229 , 1093 ;
458 , 687 ; 458 , 1093 ;
687 , 687 ; 687 , 1093 ;
916 , 687 ; 916 , 1093 ;
1145 , 687 ; 1145 , 1093 ;
1374 , 687 ; 1374 , 1093 ;
1603 , 687 ; 1603 , 1093 ;
1832 , 687 ; 1832 , 1093 ;
2061 , 687 ; 2061 , 1093 ;
2290 , 687 ; 2290 , 1093 ;
2519 , 687 ; 2519 , 1093 ;
2748 , 687 ; 2748 , 1093 ;];
R_5=[];
R_6=[];


%***********************************************************************************
for i=1:size(R_P12,1)
rectangle('Position',[R_P12(i,1) R_P12(i,2) 373 201],'EdgeColor', 'b', 'LineWidth', 1)
axis equal
hold on;
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for i=1:size(R_P31,1)
rectangle('Position',[R_P31(i,1) R_P31(i,2) 406 229],'EdgeColor', 'r', 'LineWidth', 1)
axis equal
hold on;
end
for i=1:size(R_P32,1)
rectangle('Position',[R_P32(i,1) R_P32(i,2) 229 406],'EdgeColor', 'r', 'LineWidth', 1)
axis equal
hold on;
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for i=1:size(R_5,1)
rectangle('Position',[R_5(i,1) R_5(i,2) 201 373],'EdgeColor', 'b', 'LineWidth', 1)
axis equal
hold on;
end
for i=1:size(R_6,1)
rectangle('Position',[R_6(i,1) R_6(i,2) 373 201],'EdgeColor', 'b', 'LineWidth', 1)
axis equal
hold on;
end
set(gca,'XLim',[0 3000]);%X轴的数据显示范围
set(gca,'YLim',[0 1500]);%设置要显示坐标刻度